driver-tests/smtpbc/SMTPBCTests/multipleToSubjectJbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/trigger">
  <soapenv:Body>
    <trig:triggerOperation>
      <part1>?string?</part1>
    </trig:triggerOperation>
  </soapenv:Body>
</soapenv:Envelope>